# ============================================================================
# Brewfile - macOS Homebrew packages reference
# ============================================================================
# This file is for reference. On macOS, Homebrew manages these packages.
# Use 'brew bundle install --file=Brewfile' to install from this file.
#
# Note: For automatic installation, use ./install-tools.sh instead.
# ============================================================================

# Core Tools
brew "git"
brew "curl"
brew "wget"
brew "zsh"
brew "tmux"
brew "coreutils"

# Search & Navigation
brew "ripgrep"
brew "bat"
brew "eza"
brew "tree"
brew "tldr"

# Development
brew "neovim"
brew "cmake"
brew "make"
brew "gcc"

# Databases
brew "postgresql@15"
brew "mariadb"
brew "redis"

# Cloud CLIs
brew "google-cloud-sdk"
brew "azure-cli"
brew "rclone"

# Database CLI
brew "mycli"

# Fonts
cask "font-jetbrains-mono"

# ============================================================================
# Optional - Install manually if needed
# ============================================================================

# Java (heavy - uncomment if needed)
# brew "temurin"
# brew "maven"

# LLVM (heavy - uncomment if needed)
# brew "llvm"

# Development Tools (optional)
# brew "docker"
# brew "kubectl"
# brew "helm"
# brew "terraform"
# brew "ansible"

# ============================================================================
# Commands
# ============================================================================
#
# Install from Brewfile:
#   brew bundle install --file=~/Config/dotfiles/Brewfile
#
# Update packages:
#   brew bundle update --file=~/Config/dotfiles/Brewfile
#
# Clean up:
#   brew bundle cleanup --file=~/Config/dotfiles/Brewfile
#
# List installed packages:
#   brew bundle list --file=~/Config/dotfiles/Brewfile
